IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_rtos.c
#include "camera_rtos.h"

#include "camera_cli.h"
#include "camera_dcmi_dma.h"
#include "camera_frame_buffer.h"
#include "camera_image_process.h"
#include "camera_pc_dump.h"
#include "camera_uart_dispatcher.h"
#include "bsp_log.h"
#include "cmsis_os.h"
#include "stm32f4xx_hal_iwdg.h"
#include "uart_rx_dma.h"

#include <stddef.h>

//============================================================================
// @file    camera_rtos.c
// @brief   摄像头 RTOS 任务模块实现
//          提供 CameraServiceTask（处理 PC 命令、拍照、图像处理、发送帧）
//          和 MonitorTask（定期统计监控）两个 FreeRTOS 任务。
//============================================================================

// 等待 DCMI 快照完成的最大超时时间（毫秒）
#define CAMERA_RTOS_SNAPSHOT_TIMEOUT_MS          3000U

// CameraServiceTask 每次从 StreamBuffer 读取的最大字节数
#define CAMERA_RTOS_UART_RX_CHUNK_SIZE             32U

// CameraServiceTask 等待接收字节的最长时间
#define CAMERA_RTOS_UART_READ_TIMEOUT_MS           100U

// CameraServiceTask 栈余量的周期采样间隔（毫秒）
#define CAMERA_RTOS_STACK_SAMPLE_PERIOD_MS         1000U

// IWDG参数：LSI约32 kHz时，(999 + 1) * 256 / 32000约为8秒
#define CAMERA_RTOS_IWDG_PRESCALER                  IWDG_PRESCALER_256
#define CAMERA_RTOS_IWDG_RELOAD                     999U
#define CAMERA_RTOS_IWDG_TIMEOUT_MS                 8000U
#define CAMERA_RTOS_IWDG_CAMERA_AGE_LIMIT_MS        6000U
#define CAMERA_RTOS_IWDG_MONITOR_AGE_LIMIT_MS       3000U
#define CAMERA_RTOS_IWDG_UPDATE_TIMEOUT_MS          100U
#define CAMERA_RTOS_IWDG_UPDATE_FLAGS               (IWDG_SR_RVU | IWDG_SR_PVU)

// 静态变量：保存 UART 句柄（用于日志和 PC 通信）
static UART_HandleTypeDef *s_camera_rtos_uart;

// 静态变量：运行统计信息结构体
static CameraRtosStats_t s_camera_rtos_stats;

// 静态变量：文本与二进制协议分发器
static CameraUartDispatcher_t s_camera_uart_dispatcher;

// 静态变量：帧序号（每次成功发送后递增）
static uint32_t s_camera_rtos_frame_id = 1U;

// IWDG句柄仅供初始化和MonitorTask刷新使用
static IWDG_HandleTypeDef s_camera_rtos_iwdg;

// 重置所有统计计数为 0
static void Camera_RTOS_ClearStats(void)
{
    s_camera_rtos_stats.camera_service_loop_count = 0U;
    s_camera_rtos_stats.monitor_tick_count = 0U;
    s_camera_rtos_stats.cli_command_count = 0U;
    s_camera_rtos_stats.cli_unknown_count = 0U;
    s_camera_rtos_stats.dump_request_count = 0U;
    s_camera_rtos_stats.dump_success_count = 0U;
    s_camera_rtos_stats.dump_error_count = 0U;
    s_camera_rtos_stats.uart_none_count = 0U;
    s_camera_rtos_stats.uart_pending_count = 0U;
    s_camera_rtos_stats.uart_error_count = 0U;
    s_camera_rtos_stats.binary_request_count = 0U;
    s_camera_rtos_stats.binary_request_success_count = 0U;
    s_camera_rtos_stats.binary_request_error_count = 0U;
    s_camera_rtos_stats.binary_request_crc_error_count = 0U;
    s_camera_rtos_stats.binary_request_version_error_count = 0U;
    s_camera_rtos_stats.binary_request_type_error_count = 0U;
    s_camera_rtos_stats.binary_request_length_error_count = 0U;
    s_camera_rtos_stats.binary_request_eof_error_count = 0U;
    s_camera_rtos_stats.binary_request_timeout_count = 0U;
    s_camera_rtos_stats.last_binary_request_seq = 0U;
    s_camera_rtos_stats.last_binary_error_code = IMAGE_REQUEST_PARSE_NONE;
    s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_NONE;
    s_camera_rtos_stats.last_dump_time_ms = 0U;
    s_camera_rtos_stats.last_status_time_ms = 0U;
    s_camera_rtos_stats.uptime_ms = 0U;
    s_camera_rtos_stats.health_sample_count = 0U;
    s_camera_rtos_stats.camera_service_stack_min_free_bytes = 0U;
    s_camera_rtos_stats.monitor_stack_min_free_bytes = 0U;
    s_camera_rtos_stats.free_heap_bytes = 0U;
    s_camera_rtos_stats.min_ever_free_heap_bytes = 0U;
    s_camera_rtos_stats.hook_fault_code = 0U;
    s_camera_rtos_stats.hook_fault_count = 0U;
    s_camera_rtos_stats.assert_line = 0U;
    s_camera_rtos_stats.camera_service_heartbeat_count = 0U;
    s_camera_rtos_stats.monitor_heartbeat_count = 0U;
    s_camera_rtos_stats.camera_service_heartbeat_ms = 0U;
    s_camera_rtos_stats.monitor_heartbeat_ms = 0U;
    s_camera_rtos_stats.camera_service_heartbeat_age_ms = 0U;
    s_camera_rtos_stats.monitor_heartbeat_age_ms = 0U;
    s_camera_rtos_stats.iwdg_enabled = 0U;
    s_camera_rtos_stats.iwdg_refresh_count = 0U;
    s_camera_rtos_stats.iwdg_refresh_skip_count = 0U;
    s_camera_rtos_stats.iwdg_last_refresh_ms = 0U;
    s_camera_rtos_stats.iwdg_last_skip_ms = 0U;
    s_camera_rtos_stats.iwdg_last_skip_reason = CAMERA_RTOS_IWDG_SKIP_NONE;
    s_camera_rtos_stats.iwdg_timeout_ms = CAMERA_RTOS_IWDG_TIMEOUT_MS;
    s_camera_rtos_stats.iwdg_camera_age_limit_ms =
        CAMERA_RTOS_IWDG_CAMERA_AGE_LIMIT_MS;
    s_camera_rtos_stats.iwdg_monitor_age_limit_ms =
        CAMERA_RTOS_IWDG_MONITOR_AGE_LIMIT_MS;
}

// 当前构建未纳入HAL IWDG源文件，在此提供等价的最小初始化实现
HAL_StatusTypeDef HAL_IWDG_Init(IWDG_HandleTypeDef *hiwdg)
{
    uint32_t tick_start;

    if ((hiwdg == NULL) || (hiwdg->Instance != IWDG) ||
        (IS_IWDG_PRESCALER(hiwdg->Init.Prescaler) == 0U) ||
        (IS_IWDG_RELOAD(hiwdg->Init.Reload) == 0U))
    {
        return HAL_ERROR;
    }

    __HAL_IWDG_START(hiwdg);
    IWDG_ENABLE_WRITE_ACCESS(hiwdg);
    hiwdg->Instance->PR = hiwdg->Init.Prescaler;
    hiwdg->Instance->RLR = hiwdg->Init.Reload;

    tick_start = HAL_GetTick();
    while ((hiwdg->Instance->SR & CAMERA_RTOS_IWDG_UPDATE_FLAGS) != 0U)
    {
        if ((HAL_GetTick() - tick_start) > CAMERA_RTOS_IWDG_UPDATE_TIMEOUT_MS)
        {
            return HAL_TIMEOUT;
        }
    }

    __HAL_IWDG_RELOAD_COUNTER(hiwdg);
    return HAL_OK;
}

// 当前构建未纳入HAL IWDG源文件，在此提供HAL刷新接口
HAL_StatusTypeDef HAL_IWDG_Refresh(IWDG_HandleTypeDef *hiwdg)
{
    if ((hiwdg == NULL) || (hiwdg->Instance != IWDG))
    {
        return HAL_ERROR;
    }

    __HAL_IWDG_RELOAD_COUNTER(hiwdg);
    return HAL_OK;
}

// CMSIS-RTOS2 返回当前任务启动以来的历史最小栈余量，单位为字节
static uint32_t Camera_RTOS_GetCurrentTaskStackMinFreeBytes(void)
{
    return osThreadGetStackSpace(osThreadGetId());
}

// 在 CameraServiceTask 自身上下文读取最新的历史最小栈余量
static void Camera_RTOS_UpdateCameraServiceStackStats(void)
{
    s_camera_rtos_stats.camera_service_stack_min_free_bytes =
        Camera_RTOS_GetCurrentTaskStackMinFreeBytes();
}

// 在 MonitorTask 自身上下文更新历史最小栈余量、Heap 和健康采样计数
static void Camera_RTOS_UpdateMonitorHealthStats(void)
{
    s_camera_rtos_stats.monitor_stack_min_free_bytes =
        Camera_RTOS_GetCurrentTaskStackMinFreeBytes();
    s_camera_rtos_stats.free_heap_bytes = (uint32_t)xPortGetFreeHeapSize();
    s_camera_rtos_stats.min_ever_free_heap_bytes =
        (uint32_t)xPortGetMinimumEverFreeHeapSize();
    s_camera_rtos_stats.health_sample_count++;
}

// 按同一个tick快照计算两个任务的心跳年龄
static void Camera_RTOS_UpdateHeartbeatAges(uint32_t current_tick)
{
    s_camera_rtos_stats.camera_service_heartbeat_age_ms =
        (current_tick >= s_camera_rtos_stats.camera_service_heartbeat_ms) ?
        (current_tick - s_camera_rtos_stats.camera_service_heartbeat_ms) : 0U;
    s_camera_rtos_stats.monitor_heartbeat_age_ms =
        (current_tick >= s_camera_rtos_stats.monitor_heartbeat_ms) ?
        (current_tick - s_camera_rtos_stats.monitor_heartbeat_ms) : 0U;
}

// 根据Hook和任务心跳状态决定本周期是否允许刷新IWDG
static CameraRtosIwdgSkipReason_t Camera_RTOS_GetIwdgSkipReason(
    uint32_t current_tick)
{
    Camera_RTOS_UpdateHeartbeatAges(current_tick);

    if (s_camera_rtos_stats.hook_fault_code != 0U)
    {
        return CAMERA_RTOS_IWDG_SKIP_HOOK_FAULT;
    }
    if (s_camera_rtos_stats.camera_service_heartbeat_count == 0U)
    {
        return CAMERA_RTOS_IWDG_SKIP_CAMERA_NOT_STARTED;
    }
    if (s_camera_rtos_stats.monitor_heartbeat_count == 0U)
    {
        return CAMERA_RTOS_IWDG_SKIP_MONITOR_NOT_STARTED;
    }
    if (s_camera_rtos_stats.camera_service_heartbeat_age_ms >
        CAMERA_RTOS_IWDG_CAMERA_AGE_LIMIT_MS)
    {
        return CAMERA_RTOS_IWDG_SKIP_CAMERA_TIMEOUT;
    }
    if (s_camera_rtos_stats.monitor_heartbeat_age_ms >
        CAMERA_RTOS_IWDG_MONITOR_AGE_LIMIT_MS)
    {
        return CAMERA_RTOS_IWDG_SKIP_MONITOR_TIMEOUT;
    }

    return CAMERA_RTOS_IWDG_SKIP_NONE;
}

