IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_rtos.c
// 仅由MonitorTask调用：健康条件满足时刷新，否则记录一次跳过原因
static void Camera_RTOS_ServiceIwdg(uint32_t current_tick)
{
    CameraRtosIwdgSkipReason_t skip_reason;
    uint32_t previous_skip_reason;

    if (s_camera_rtos_stats.iwdg_enabled == 0U)
    {
        return;
    }

    skip_reason = Camera_RTOS_GetIwdgSkipReason(current_tick);
    if (skip_reason == CAMERA_RTOS_IWDG_SKIP_NONE)
    {
        (void)HAL_IWDG_Refresh(&s_camera_rtos_iwdg);
        s_camera_rtos_stats.iwdg_refresh_count++;
        s_camera_rtos_stats.iwdg_last_refresh_ms = current_tick;
        return;
    }

    previous_skip_reason = s_camera_rtos_stats.iwdg_last_skip_reason;
    s_camera_rtos_stats.iwdg_refresh_skip_count++;
    s_camera_rtos_stats.iwdg_last_skip_ms = current_tick;
    s_camera_rtos_stats.iwdg_last_skip_reason = (uint32_t)skip_reason;

    // 同一种异常只输出一次，后续保持不喂狗并等待硬件复位
    if (previous_skip_reason != (uint32_t)skip_reason)
    {
        LOG_ERROR("IWDG refresh skipped, reason=%u", (unsigned int)skip_reason);
    }
}

// 记录一条完整 CLI 命令
void Camera_RTOS_RecordCliCommand(void)
{
    s_camera_rtos_stats.cli_command_count++;
}

// 记录一条未知 CLI 命令
void Camera_RTOS_RecordCliUnknown(void)
{
    s_camera_rtos_stats.cli_unknown_count++;
    s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_UNKNOWN_CMD;
}

// 记录一次 DUMP 请求
void Camera_RTOS_RecordDumpRequest(void)
{
    s_camera_rtos_stats.dump_request_count++;
}

// 记录一次成功 DUMP 及其耗时
void Camera_RTOS_RecordDumpSuccess(uint32_t elapsed_ms)
{
    s_camera_rtos_stats.dump_success_count++;
    s_camera_rtos_stats.last_dump_time_ms = elapsed_ms;
}

// 记录一次失败 DUMP 及其错误码
void Camera_RTOS_RecordDumpError(uint32_t error_code)
{
    s_camera_rtos_stats.dump_error_count++;
    s_camera_rtos_stats.last_error_code =
        (error_code == CAMERA_RTOS_ERR_NONE) ? CAMERA_RTOS_ERR_DUMP_FAILED : error_code;
}

// 记录一次 UART 无数据状态
void Camera_RTOS_RecordUartNone(void)
{
    s_camera_rtos_stats.uart_none_count++;
}

// 记录一次 UART 命令接收中状态
void Camera_RTOS_RecordUartPending(void)
{
    s_camera_rtos_stats.uart_pending_count++;
}

// 记录一次 UART 接收错误
void Camera_RTOS_RecordUartError(void)
{
    s_camera_rtos_stats.uart_error_count++;
    s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_BAD_STATE;
}

// 记录最近一次 STATUS 命令执行时间
void Camera_RTOS_RecordStatus(uint32_t time_ms)
{
    s_camera_rtos_stats.last_status_time_ms = time_ms;
}

// 记录FreeRTOS严重错误Hook；该函数不分配内存，也不执行复杂业务
void Camera_RTOS_RecordHookFault(uint32_t fault_code, uint32_t assert_line)
{
    s_camera_rtos_stats.hook_fault_code = fault_code;
    s_camera_rtos_stats.hook_fault_count++;
    s_camera_rtos_stats.assert_line = assert_line;
}

// 将 UART DMA 错误统计同步到 Stage 8 兼容字段
static void Camera_RTOS_SyncUartErrorCount(void)
{
    const UartRxDmaStats_t *uart_stats = UART_RxDma_GetStats();

    if (uart_stats != NULL)
    {
        s_camera_rtos_stats.uart_error_count = uart_stats->uart_error_count;
    }
}

// 在任务上下文处理 UART DMA 错误恢复，并丢弃恢复前的残缺输入
static uint8_t Camera_RTOS_RecoverUartInputIfNeeded(void)
{
    UartRxDmaRecoveryResult_t recovery_result;

    recovery_result = UART_RxDma_RecoverIfNeeded();
    Camera_RTOS_SyncUartErrorCount();

    if (recovery_result == UART_RX_DMA_RECOVERY_NONE)
    {
        return 0U;
    }

    s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_UART_DMA_RECOVERY;
    if (recovery_result == UART_RX_DMA_RECOVERY_RETRY)
    {
        (void)osDelay(1U);
        return 1U;
    }

    CameraUartDispatcher_Reset(&s_camera_uart_dispatcher);
    Camera_PC_Dump_ResetCommandParser();
    (void)UART_RxDma_Drain();
    if (UART_RxDma_HasOverflow() != 0U)
    {
        UART_RxDma_ClearOverflow();
    }
    return 1U;
}

// 检测 StreamBuffer 溢出，清除残缺协议状态并排空现有字节
static uint8_t Camera_RTOS_DiscardOverflowedInput(void)
{
    if (UART_RxDma_HasOverflow() == 0U)
    {
        return 0U;
    }

    CameraUartDispatcher_Reset(&s_camera_uart_dispatcher);
    Camera_PC_Dump_ResetCommandParser();
    (void)UART_RxDma_Drain();
    UART_RxDma_ClearOverflow();
    s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_STREAM_OVERFLOW;
    return 1U;
}

// 执行完整的“捕获 → 图像处理 → 发送”流程，返回错误码（0 表示成功）
static uint32_t Camera_RTOS_CaptureProcessAndSend(void)
{
    uint8_t snapshot_ret;                      // DCMI 快照启动返回值（0 成功）
    uint8_t dump_ret;                          // PC Dump 发送返回值（0 成功）
    uint32_t snapshot_start_tick;              // 快照启动时的时间戳（毫秒）
    CameraFrameBufferStatus_t commit_ret;      // 帧缓冲区提交结果
    CameraImageProcessStatus_t process_ret;    // 图像处理结果
    CameraProcessMode_t process_mode;          // 当前 CLI 配置的处理模式
    uint8_t binary_threshold;                  // 当前 CLI 配置的二值化阈值

    // 清除之前可能残留的快照完成标志，确保本次快照状态干净
    Camera_DCMI_ClearSnapshotDone();

    // 启动 DCMI 快照，将图像数据写入 PC Dump 缓冲区（即后台缓冲区）
    // 该缓冲区地址和传输字数是固定的，由 PC Dump 模块提供
    snapshot_ret = Camera_DCMI_StartSnapshotToBuffer(
        Camera_PC_Dump_GetBufferAddress(),
        Camera_PC_Dump_GetWordCount());
    if (snapshot_ret != 0U)
    {
        Camera_DCMI_Stop();   // 启动失败则立即停止 DCMI，避免异常状态
        // 返回组合错误码：基础错误码 + DCMI 返回的子错误码
        return CAMERA_RTOS_ERR_SNAPSHOT_START_BASE | (uint32_t)snapshot_ret;
    }

    // 等待快照完成，超时则停止并返回错误
    snapshot_start_tick = HAL_GetTick();
    while (Camera_DCMI_IsSnapshotDone() == 0U)
    {
        // 检查是否超过设定的超时时间（通常 3000ms）
        if ((HAL_GetTick() - snapshot_start_tick) > CAMERA_RTOS_SNAPSHOT_TIMEOUT_MS)
        {
            Camera_DCMI_Stop();   // 超时强制停止 DCMI
            return CAMERA_RTOS_ERR_SNAPSHOT_TIMEOUT;
        }
        (void)osDelay(1U);  // 让出 CPU，避免忙等，同时保证响应及时
    }

    Camera_DCMI_Stop();   // 快照完成，正常停止 DCMI（释放资源）

    // 提交后台缓冲区，使新捕获的帧成为前台帧（双缓冲切换）
    commit_ret = Camera_FrameBuffer_CommitBackBuffer();
    if (commit_ret != CAMERA_FB_OK)
    {
        // 提交失败，返回包含帧缓冲区错误码的组合错误
        return CAMERA_RTOS_ERR_CAPTURE_COMMIT_BASE | (uint32_t)commit_ret;
    }

    // 获取当前 CLI 配置的处理模式和二值化阈值（可能通过串口命令动态修改）
    process_mode = Camera_CLI_GetProcessMode();
    binary_threshold = Camera_CLI_GetBinaryThreshold();

    // 对帧缓冲区应用图像处理（旁路/灰度/二值化），处理结果直接写回后台缓冲区，
    // 然后自动提交成为新的前台帧（ApplyToFrameBuffer 内部会提交）
    process_ret = Camera_ImageProcess_ApplyToFrameBuffer(process_mode, binary_threshold);
    if (process_ret != CAMERA_PROCESS_OK)
    {
        // 如果用户配置的处理模式执行失败（例如内存不足或参数异常），
        // 则尝试回退到旁路模式（不处理图像），确保至少能发送原始图像数据
        process_ret = Camera_ImageProcess_ApplyToFrameBuffer(
            CAMERA_PROCESS_MODE_BYPASS,
            binary_threshold);
        if (process_ret != CAMERA_PROCESS_OK)
        {
            // 旁路模式仍然失败，说明系统存在严重错误，返回图像处理错误码
            return CAMERA_RTOS_ERR_IMAGE_PROCESS_BASE | (uint32_t)process_ret;
        }
        // 注意：若旁路模式成功，则不会返回错误，继续执行发送流程
    }

    // 将当前前台帧（已经过处理或旁路）通过 UART 打包发送给 PC
    // 帧序号 s_camera_rtos_frame_id 会随每次成功发送递增，便于 PC 端识别
    dump_ret = Camera_PC_Dump_SendFrame(s_camera_rtos_uart, s_camera_rtos_frame_id);
    if (dump_ret != 0U)
    {
        // 发送失败（可能因为 UART 错误、帧头/CRC 错误等），返回对应的发送错误码
        return CAMERA_RTOS_ERR_DUMP_SEND_BASE | (uint32_t)dump_ret;
    }

