IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_rtos.c
    // 成功发送后递增帧序号，为下一帧准备
    s_camera_rtos_frame_id++;
    return CAMERA_RTOS_ERR_NONE;   // 全部流程顺利完成，返回无错误标志
}

// 文本和二进制请求共用同一条 DUMP 执行路径
static uint8_t Camera_RTOS_ProcessDumpRequest(void)
{
    uint32_t error_code;
    uint32_t dump_start_tick;
    uint32_t dump_elapsed_ms;

    Camera_RTOS_RecordDumpRequest();
    dump_start_tick = HAL_GetTick();
    error_code = Camera_RTOS_CaptureProcessAndSend();
    dump_elapsed_ms = HAL_GetTick() - dump_start_tick;
    Camera_RTOS_UpdateCameraServiceStackStats();
    if (error_code == CAMERA_RTOS_ERR_NONE)
    {
        Camera_RTOS_RecordDumpSuccess(dump_elapsed_ms);
        return 1U;
    }

    s_camera_rtos_stats.last_dump_time_ms = dump_elapsed_ms;
    Camera_RTOS_RecordDumpError(error_code);
    return 0U;
}

// 记录合法二进制请求，序号仅用于请求统计
static void Camera_RTOS_RecordBinaryRequest(
    const ImageRequestFrame_t *request)
{
    s_camera_rtos_stats.binary_request_count++;
    s_camera_rtos_stats.last_binary_request_seq = request->seq;
}

// 记录二进制解析错误并更新分类计数
static void Camera_RTOS_RecordBinaryError(
    ImageRequestParseResult_t parse_result)
{
    s_camera_rtos_stats.binary_request_error_count++;
    s_camera_rtos_stats.last_binary_error_code = (uint32_t)parse_result;

    switch (parse_result)
    {
        case IMAGE_REQUEST_PARSE_CRC_ERROR:
            s_camera_rtos_stats.binary_request_crc_error_count++;
            break;

        case IMAGE_REQUEST_PARSE_VERSION_ERROR:
            s_camera_rtos_stats.binary_request_version_error_count++;
            break;

        case IMAGE_REQUEST_PARSE_TYPE_ERROR:
            s_camera_rtos_stats.binary_request_type_error_count++;
            break;

        case IMAGE_REQUEST_PARSE_LENGTH_ERROR:
            s_camera_rtos_stats.binary_request_length_error_count++;
            break;

        case IMAGE_REQUEST_PARSE_EOF_ERROR:
            s_camera_rtos_stats.binary_request_eof_error_count++;
            break;

        default:
            break;
    }
}

// 记录二进制半帧超时，不发送任何文本响应
static void Camera_RTOS_RecordBinaryTimeout(void)
{
    s_camera_rtos_stats.binary_request_timeout_count++;
    s_camera_rtos_stats.last_binary_error_code = IMAGE_REQUEST_PARSE_TIMEOUT;
}

// 将一个文本字节送入现有命令解析器
static void Camera_RTOS_ProcessTextByte(uint8_t byte)
{
    uint8_t command;

    command = Camera_PC_Dump_FeedCommandByte(s_camera_rtos_uart, byte);
    if (command == CAMERA_PC_DUMP_CMD_PENDING)
    {
        Camera_RTOS_RecordUartPending();
        return;
    }

    // CLI 命令已在文本行解析器内部处理
    if (command == CAMERA_PC_DUMP_CMD_CLI)
    {
        return;
    }

    if (command == CAMERA_PC_DUMP_CMD_DUMP)
    {
        (void)Camera_RTOS_ProcessDumpRequest();
        return;
    }

    s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_BAD_STATE;
}

// 处理分发器产生的单个业务事件
static void Camera_RTOS_ProcessDispatchEvent(
    CameraUartDispatchResult_t result,
    const CameraUartDispatchEvent_t *event)
{
    switch (result)
    {
        case CAMERA_UART_DISPATCH_TEXT_BYTE:
            Camera_RTOS_ProcessTextByte(event->text_byte);
            break;

        case CAMERA_UART_DISPATCH_IMAGE_REQUEST:
            Camera_RTOS_RecordBinaryRequest(&event->image_request);
            if (Camera_RTOS_ProcessDumpRequest() != 0U)
            {
                s_camera_rtos_stats.binary_request_success_count++;
            }
            break;

        case CAMERA_UART_DISPATCH_BINARY_ERROR:
            Camera_RTOS_RecordBinaryError(event->binary_result);
            break;

        case CAMERA_UART_DISPATCH_BINARY_TIMEOUT:
            Camera_RTOS_RecordBinaryTimeout();
            break;

        case CAMERA_UART_DISPATCH_BAD_ARGUMENT:
            s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_BAD_STATE;
            break;

        case CAMERA_UART_DISPATCH_NONE:
        default:
            break;
    }
}

// 初始化摄像头 RTOS 模块（保存 UART 句柄，重置统计和帧号）
void Camera_RTOS_Init(UART_HandleTypeDef *huart)
{
    s_camera_rtos_uart = NULL;
    s_camera_rtos_frame_id = 1U;
    Camera_RTOS_ClearStats();

    if (huart == NULL)
    {
        s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_UART_NULL;
        return;
    }

    s_camera_rtos_uart = huart;
}

// 在调度器启动前配置并启动IWDG，运行期仅由MonitorTask刷新
HAL_StatusTypeDef Camera_RTOS_IwdgInit(void)
{
    HAL_StatusTypeDef status;

    s_camera_rtos_iwdg.Instance = IWDG;
    s_camera_rtos_iwdg.Init.Prescaler = CAMERA_RTOS_IWDG_PRESCALER;
    s_camera_rtos_iwdg.Init.Reload = CAMERA_RTOS_IWDG_RELOAD;

    status = HAL_IWDG_Init(&s_camera_rtos_iwdg);
    if (status == HAL_OK)
    {
        s_camera_rtos_stats.iwdg_enabled = 1U;
    }

    return status;
}

// 摄像头服务任务（FreeRTOS 任务主循环）
// 功能：管理 UART 命令接收、DMA 数据传输、命令解析及图像采集触发
void Camera_RTOS_CameraServiceTask(void *argument)
{
    uint8_t rx_chunk[CAMERA_RTOS_UART_RX_CHUNK_SIZE];    // 用于从 DMA 环形缓冲区读取数据的临时块
    size_t received;                                     // 本次实际读取的字节数
    size_t i;                                            // 循环索引
    uint32_t stack_sample_tick;                          // 上次采样栈使用量的时间戳
    uint32_t current_tick;                               // 当前时间戳
    CameraUartDispatchEvent_t dispatch_event;            // 解析器产生的事件（如收到完整命令）
    CameraUartDispatchResult_t dispatch_result;          // 解析器处理单字节的返回结果

    (void)argument;  // 未使用的参数，避免编译警告

    // 初始化 UART 命令分发器（负责解析字节流、识别命令帧）
    CameraUartDispatcher_Init(&s_camera_uart_dispatcher);
    // 重置 PC Dump 命令解析器的内部状态（清空缓存行）
    Camera_PC_Dump_ResetCommandParser();

    // 等待 UART 句柄被外部初始化（Camera_RTOS_Init 设置）
    // 若句柄为空，则记录错误并延时重试
    while (s_camera_rtos_uart == NULL)
    {
        s_camera_rtos_stats.camera_service_loop_count++;
        s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_UART_NULL;
        (void)osDelay(1000U);
    }

    // 初始化 UART DMA 接收（配置 DMA 环形缓冲区，启动连续接收）
    // 若初始化失败，则记录错误并反复重试
    while (UART_RxDma_Init(s_camera_rtos_uart) != HAL_OK)
    {
        s_camera_rtos_stats.camera_service_loop_count++;
        s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_UART_DMA_INIT;
        (void)osDelay(1000U);
    }

    // 首次采样并更新任务栈使用统计（用于监控堆栈溢出）
    Camera_RTOS_UpdateCameraServiceStackStats();
    stack_sample_tick = HAL_GetTick();

    // 主循环：反复从 DMA 环形缓冲区读取数据，送入解析器处理
    for (;;)
    {
        // 任务运行计数累加（供统计）
        s_camera_rtos_stats.camera_service_loop_count++;
        // 每轮主循环更新心跳；本轮只记录状态，不做卡死判定或复位
        s_camera_rtos_stats.camera_service_heartbeat_count++;
        s_camera_rtos_stats.camera_service_heartbeat_ms = HAL_GetTick();

